[
  {
    "path": "posts/2022-05-26-basis-data/",
    "title": "Basis Data",
    "description": "Modul 7/EKMA4434",
    "author": [
      {
        "name": "Tedy Herlambang",
        "url": "https://bangtedy.github.io"
      }
    ],
    "date": "2022-05-26",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nPENDAHULUAN\r\nKEGIATAN BELALAJAR\r\n1: Konsep Basis Data\r\nA. DEFINISI BASIS DATA\r\nB.\r\nPENDEKATAN TRADISIONAL DAN PENDEKATAN BASIS DATA\r\nPendekatan basis data\r\n\r\n\r\nPENDAHULUAN\r\nmodul ini akan membahas tentang basis data (database). Basis data\r\nmerupakan komponen yang penting di sistem informasi. Tanpa basis data\r\nmaka tidak akan dapat dihasilkan informasi yang dibutuhkan tepat waktu\r\nkarena basis data adalah sumber utama dari informasi.\r\nSesudah mempelajari dengan baik modul ini, Anda diharapkan mampu:\r\n\r\nmenjelaskan konsep basis data;\r\nmenjelaskan perbedaan antara pendekatan tradisional dan pendekatan\r\nbasis data;\r\nmemahami jenjang dari data;\r\nmemahami macam-macam file yang ada;\r\nmembedakan basis data logikal dan basis data fisik;\r\nmengetahui proses basis data;\r\nmengetahui organisasi basis data;\r\nmengetahui software pendukung basis data;\r\nmengetahui penggunaan perangkat lunak basis data;\r\nmengetahui basis data sebagai pendukung sistem informasi;\r\nmengetahui basis data multidimensi;\r\nmenjelaskan administrasi basis data;\r\nmenjelaskan struktur basis data;\r\nmenjelaskan organisasi dan manajemen basis data.\r\n\r\n\r\nKEGIATAN BELALAJAR 1:\r\nKonsep Basis Data\r\nA. DEFINISI BASIS DATA\r\nThink about web browser\r\nTo communicate with others,\r\nTo visit our favourite online sports store to search for\r\nmountain-bike\r\nWe enter a price range, models, etc…\r\nWithin a few seconds, the screen is filled with details on available\r\nmodels complete with product photos and specifications.\r\n–> Where did this rich, well-organized information come from?\r\nDatabases\r\n–> Combined with interactive webpages on the Internet, databases\r\nhave made an immense contribution to commerce.\r\n– > online banking, consumer catalogs, search engines, stock\r\nbrokerages, or social media.\r\n–> Their impact on business has allowed fewer people to complete\r\nlarger tasks, and their power has enabled organizations to learn more\r\nconsumers\r\nEvery time you enter the address of a website, a special program\r\nperforms a search in a huge database and matches your request with one\r\nof hundreds of millions of addresses.\r\nEvery time you fill out an online form with details such as your\r\naddress, phone number, or credit-card number, a program feeds the data\r\ninto a database, where each item is recorded for further use.\r\n\r\n\r\nBasis data (database) merupakan kumpulan dari data yang saling\r\nberhubungan satu dengan yang lainnya, tersimpan di perangkat keras\r\nkomputer dan digunakan perangkat lunak untuk memanipulasinya.\r\nBasis data komponen yang penting dalam sistem informasi karena\r\nmenyediakan informasi bagi para pemakai.\r\nPenerapan basis data dalam sistem informasi disebut dengan\r\ndatabase system.\r\nSistem basis data (database system) adalah suatu sistem informasi\r\nyang mengintegrasikan kumpulan dari data yang saling berhubungan satu\r\ndengan yang lainnya dan membuatnya tersedia untuk beberapa aplikasi yang\r\nbermacam-macam di dalam suatu organisasi.\r\n\r\nB.\r\nPENDEKATAN TRADISIONAL DAN PENDEKATAN BASIS DATA\r\nPendekatan tradisional mengumpulkan data ke dalam file-file yang\r\ntidak berhubungan satu dengan yang lainnya.\r\nBiasanya tiap-tiap file dirancang untuk aplikasi yang\r\ntertentu.\r\n\r\n\r\n\r\n\r\nKelemahan Pendekatan\r\nTradisional\r\nTerjadi duplikasi data (data redundancy)\r\n\r\nTidak terjadi hubungan data (data reliability).\r\n\r\nPendekatan basis data\r\nDuplikasi data (data redundancy) dikurangi. Karena basis data\r\nmerupakan kumpulan dari semua data secara umum maka dapat digunakan\r\nbersama-sama untuk semua aplikasi sehingga duplikasi data dapat\r\ndikurangi.\r\nHubungan data (data reliability) dapat ditingkatkan Karena data\r\ndikumpulkan bersama-sama maka hubungan dari data dapat ditingkatkan,\r\nyang berarti data di file tertentu dapat dihubungkan dengan data di\r\nfile-file lainnya.\r\n\r\nC. JENJANG DATA\r\nSampai dengan membentuk suatu basis data, data mempunyai jenjang\r\nmulai dari karakter-karakter (characters), item data (data item atau\r\nfield), record, file dan kemudian basis data.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-05-26-basis-data/pendekatan-trad.png",
    "last_modified": "2022-05-26T17:22:32+07:00",
    "input_file": {},
    "preview_width": 284,
    "preview_height": 274
  },
  {
    "path": "posts/2022-05-19-teknologi-sistem-informasi/",
    "title": "Teknologi Sistem Informasi",
    "description": "Modul 6",
    "author": [
      {
        "name": "Tedy Herlambang",
        "url": "https://bangtedy.github.io"
      }
    ],
    "date": "2022-05-19",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nPENDAHULUAN\r\nKEGIATAN\r\nBELAJAR 1: TEKNOLOGI PERANGKAT KERAS (HARDWARE)\r\nKEGIATAN\r\nBELAJAR 2: TEKNOLOGI PERANGKAT LUNAK\r\nSISTEM OPERASI\r\nSISTEM BANTUAN\r\nSOFTWARE BAHASA\r\n(LANGUAGE SOFTWARE)\r\nPERANGKAT LUNAK\r\nAPLIKASI\r\n\r\n\r\nPENDAHULUAN\r\nModul membahas teknologi yang digunakan di sistem informasi\r\nmanajemen. Teknologi itu dapat berupa teknologi sistem komputer.\r\nTeknologi sistem komputer terdiri dari hardware dan software yang\r\nbersama-sama membentuk suatu sistem.\r\nSesudah mempelajari dengan baik modul ini, Anda diharapkan mampu:\r\n\r\nmenjelaskan sifat output;\r\nmenjelaskan pusat unit pemrosesan;\r\nmenjelaskan teknologi komputer;\r\nmenjelaskan sistem hardware;\r\nmenjelaskan sistem software;\r\nmenjelaskan sistem operasi komputer;\r\nmengetahui sistem operasi komputer;\r\nmengetahui sistem jaringan komputer;\r\nmengetahui generasi-generasi bahasa program;\r\nmengetahui bahasa-bahasa program.\r\n\r\nKEGIATAN\r\nBELAJAR 1: TEKNOLOGI PERANGKAT KERAS (HARDWARE)\r\n\r\n\r\n\r\nALAT MASUKAN/INPUT DEVICE\r\n\r\nALAT PEMROSES\r\nALAT KELUARAN\r\n\r\nALAT SIMPANAN LUAR\r\nUKURAN MEMORI\r\n\r\n\r\nUKURAN KECEPATAN PROSES\r\nKLASIFIKASI KOMPUTER\r\n\r\nKEGIATAN BELAJAR\r\n2: TEKNOLOGI PERANGKAT LUNAK\r\nSISTEM OPERASI\r\nmenghubungkan perangkat lunak (software) dengan perangkat keras\r\n(hardware)\r\nsistem operasi memberikan perintah dan sebagai mediator antara\r\nmanusia dengan computer\r\nmengendalikan dan mengkoordinasi kegiatan operasi dari sistem\r\nkomputer\r\nJenis sistem operasi\r\nMS DOS (Disk Operating System)\r\nSistem Operasi Windows\r\nSistem Operasi Linux\r\nSistem Operasi MacOS\r\n\r\n\r\nSISTEM BANTUAN\r\ntext editor ( di Windows adalah notepad),\r\nbeberapa bantuan untuk menangani disk (misalnya memformat, menyalin,\r\nmengecek disk dan lain sebagainya),\r\nmenangani file (mengurutkan isi file, mencari file), menangani\r\ntampilan (menyetel ukuran layar) dan penanganan peralatan lainnya.\r\nSOFTWARE BAHASA (LANGUAGE\r\nSOFTWARE)\r\nBahasa mesin (machine language)\r\nbahasa perakit (assembly language)\r\nbahasa tingkat tinggi (high level language): FORTRAN, COBOL, PASCAL,\r\ndan C language;\r\nbahasa tingkat sangat tinggi (very high-level language)\r\n\r\nPERANGKAT LUNAK APLIKASI\r\nStatistik: SPSS, Stata, Minitab, Eviews, R, Gauss, Matlab\r\nKeuangan dan Akuntansi\r\nMSDM\r\nBrowser: Firefox, Google Chrome,…\r\ndll\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-05-19T15:23:45+07:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-05-19-pengembangan-sistem-informasi/",
    "title": "Pengembangan Sistem Informasi",
    "description": "Modul 5",
    "author": [
      {
        "name": "Tedy Herlambang",
        "url": "https://bangtedy.github.io"
      }
    ],
    "date": "2022-05-14",
    "categories": [],
    "contents": "\r\nPENDAHULUAN\r\nModul ini akan membahas pengembangan sistem informasi. Untuk dapat\r\nmemanfaatkan keuntungan yang ditawarkan oleh sistem informasi maka\r\nsistem informasi ini perlu dibangun. Membangun sistem informasi di\r\norganisasi disebut dengan istilah mengembangkan sistem informasi.\r\nPengembangan sistem informasi yang banyak dilakukan adalah\r\npengembangan sistem informasi yang disebut dengan systems development\r\nlife cycle (SDLC). Supaya pengembangan sistem informasi dapat dilakukan\r\ndengan lebih berhasil maka suatu metodologi pengembangan sistem perlu\r\ndigunakan.\r\nMetodologi pengembangan sistem informasi yang banyak digunakan dan\r\nakan dibahas di modul ini adalah metodologi pengembangan sistem\r\nterstruktur.\r\nSesudah mempelajari dengan baik modul ini Anda diharapkan mampu:\r\n\r\nmengembangkan sistem informasi;\r\n\r\nmemahami metode SDLC;\r\n\r\nmenjelaskan analisis sistem informasi pada organisasi;\r\n\r\nmenjelaskan desain sistem informasi pada organisasi;\r\n\r\nmenjelaskan implementasi sistem informasi pada organisasi;\r\n\r\nmemahami strategi konversi;\r\n\r\nmenjelaskan pemeliharaan sistem informasi;\r\n\r\nmemahami metodologi pengembangan sistem terstruktur;\r\n\r\nmemahami pendekatan top-down pada metodologi pengembangan sistem\r\nterstruktur;\r\n\r\nmemahami pendekatan decomposition pada metodologi pengembangan sistem\r\nterstruktur;\r\n\r\nmemahami alat-alat yang digunakan di metodologi pengembangan sistemn\r\nterstruktur.\r\n\r\nKEGIATAN\r\nBELAJAR 1: Siklus Hidup Pengembangan Sistem\r\nA. TAHAPAN-TAHAPAN DI SDLC\r\nTahapan-tahapan dalam metode SDLC adalah sebagai berikut ini.\r\nAnalisis sistem (system analysis)\r\nStudi pendahuluan.\r\nStudi kelayakan.\r\nMengidentifikasi permasalahan dan kebutuhan pemakai.\r\nMemahami sistem yang ada.\r\nMenganalisis basil penelitian.\r\n\r\nPerancangan sistem (system design)\r\nPerancangan awal.\r\nPerancangan rinci.\r\n\r\nImplementasi sis tern (system implementation)\r\nOperasi dan perawatan sistem (system operation and maintenance)\r\n\r\nSiklus atau daur hidup pengembangan sistem tampak jika sistem yang\r\nsudah dikembangkan dan dioperasikan tidak dapat dirawat lagi sehingga\r\ndibutuhkan pengembangan sistem kembali yang tampak di gambar\r\nberikut:\r\n\r\n\r\nAnalisis Sistem\r\nTahap awal dari SDLC adalah analisis sistem (system analysis). Tahap\r\nini dilakukan oleh analis sistem (system analyst).\r\nAnalis sistem (system analyst) adalah orang yang dididik khusus\r\nuntuk mengembangkan sistem secara profesional.\r\nAlasan menggunakan analis sistem di metode SDLC adalah karena metode\r\nini digunakan untuk mengembangkan sistem teknologi informasi yang\r\nkompleks.\r\nSTI yang kompleks perlu dianalisis oleh orang yang ahli di bidangnya\r\nsehingga permasalahan dapat dipecahkan dan kebutuhan pemakai sistem\r\ndapat diidentifikasi dengan benar.\r\n\r\nTahap\r\ndi analisis sistem terdiri dari kegiatan-kegiatan sebagai berikut\r\nini:\r\nStudi pendahuluan\r\nKegiatan awal dari analisis sistem adalah studi awal atau studi\r\npendahuluan tentang jenis, ruang lingkup, dan pemahaman awal dari proyek\r\npengembangan STI ini. Dari studi pendahuluan ini dapat diperoleh hasil\r\npemahaman sistem secara awal, perkiraan biaya yang dibutuhkan, dan waktu\r\nyang diperlukan untuk pengembangan STI ini.\r\nStudi kelayakan\r\nSetelah studi pendahuluan dilakukan, langkah berikutnya yang\r\ndiperlukan oleh analisis sistem adalah melakukan studi kelayakan\r\n(feasibility study). Studi kelayakan (feasibility study) terdiri dari\r\nlima macam kelayakan yang disebut dengan TELOS.\r\n\r\nStudi kelayakan (feasibility\r\nstudy)\r\nTELOS:\r\nTeknologi\r\nEkonomi\r\nLegal\r\nOperasi\r\nSosial\r\n\r\nKelayakan ekonomis\r\nJika manfaat dari STI lebih besar dari biaya-biayanya dan dana yang\r\ndibutuhkan tersedia.\r\nManfaat-manfaat berujud (tangible benefits): manfaat yang langsung\r\ndapat diukur dengan nilai uang – > spt penurunan biaya persediaan,\r\nmanfaat penurunan biaya operasi, manfaat penurunan biaya alat tulis,\r\nmanfaat peningkatan penjualan.\r\nManfaat-manfaat tidak berujud (intangible benefits): manfaat yang\r\ntidak langsung dapat diukur dengan nilai uang– > spt. manfaat\r\npeningkatan pengambilan keputusan manajemen, manfaat peningkatan\r\nkepuasan pelanggan, manfaat peningkatan moral pekerja.\r\n\r\nPerancangan Sistem\r\nTahap perancangan sistem mempunyai dua tujuan utama, yaitu sebagai\r\nberikut ini.\r\nMemberikan gambaran secara umum tentang kebutuhan informasi kepada\r\npemakai sistem secara logika.\r\nMemberikan gambaran yang jelas dan rancang bangun yang lengkap\r\nkepada pemrogram komputer dan ahli-ahli teknik lainnya.\r\n\r\nTujuan perancangan sistem yang pertama lebih dikenal dengan istilah\r\nperancangan sistem secara logika (logical system design) atau\r\nperancangan sistem secara umum (general system design).\r\nTujuan perancangan sistem yang kedua lebih dikenal dengan istilah\r\nperancangan sistem secara terinci (detail system design).\r\n\r\nImplementasi Sistem\r\nTahap berikutnya setelah sistem selesai di rancang dan dibangun\r\nadalah tahap implementasi sistem. Implementasi sis tern (system\r\nimplementation) adalah tahap meletakkan sistem supaya siap\r\ndioperasikan.\r\nTahap implementasi sistem terdiri dari beberapa kegiatan sebagai\r\nberikut:\r\nMempersiapkan rencana implementasi.\r\nMelakukan kegiatan implementasi\r\nMemilih dan melatih personil.\r\nMemilih dan mempersiapkan tempat dan lokasi sistem.\r\nMengetes sistem.\r\nMelakukan konversi sis tern.\r\n\r\nMenindaklanjuti implementasi.\r\n\r\n\r\nKonversi Sistem\r\nkonversi paralel (parallel conversion)\r\nkonversi pilot (pilot conversion) atau konversi lokasi (location\r\nconversion)\r\nkonversi bertahap (phasing conversion atau staged conversion)\r\nkonversi langsung (direct conversion atau direct cut over).\r\n\r\nOperasi dan Perawatan Sistem\r\nSetelah sistem diimplementasikan dengan berhasil, sistem akan\r\ndioperasikan dan dirawat. Tahap ini disebut dengan operasi dan perawatan\r\nsistem (system operation and maintenance). Sistem perlu dirawat karena\r\nbeberapa hal, yaitu sebagai berikut ini.\r\nSistem mengandung kesalahan yang dulunya belum terdeteksi sehingga\r\nkesalahan-kesalahan sistem perlu diperbaiki.\r\nSistem mengalami perubahan-perubahan karena permintaan baru dari\r\npemakai sistem.\r\nSistem mengalami perubahan karena perubahan lingkungan luar.\r\nSistem perlu ditingkatkan.\r\n\r\nB. KELEBIHAN DAN\r\nKEKURANGAN METODE SDLC\r\nMetode SDLC mempunyai beberapa kelebihan dan kekurangan.\r\nKelebihan-kelebihan dari metode ini adalah sebagai berikut ini.\r\nMenyediakan tahapan yang dapat digunakan sebagai pedoman\r\nmengembangkan sistem.\r\nAkan memberikan basil sistem yang lebih baik karena sistem\r\ndianalisis dan dirancang secara keseluruhan sebelum\r\ndiimplementasikan.\r\nKekurangan-kekurangan dari metode ini adalah sebagai berikut.\r\nHanya menyediakan tahapan-tahapan saja, tetapi tidak menyediakan\r\nmetodologi (cara dan alat-alat) untuk mengembangkan sistem sebingga\r\nharus digabungkan dengan metodologi yang ada yaitu misalnya metodologi\r\npengembangan sistem terstruktur.\r\nHasil dari SDLC sangat tergantung dari basil di tahap analisis\r\nsehingga jika terdapat kesalaban analisis, akan terbawa terus dengan\r\nhasil sistem yang kurang memuaskan.\r\nDibutuhkan waktu yang lama untuk mengembangkannya karena sistem\r\nharus dikembangkan sampai selesai semua terlebib dahulu.\r\nDibutuhkan biaya yang relatif lebih besar dibandingkan dengan metode\r\nlainnya.\r\nHasil dari sistem tidak luwes untuk dimodifikasi karena perlu\r\ndilakukan analisis kembali.\r\n\r\nKEGIATAN\r\nBELAJAR 2: Metodologi Pengembangan Sistem lnformasi Terstruktur\r\nA. CARA PENGEMBANGAN SISTEM\r\nCARA PENGEMBANGAN SISTEM\r\nCara Atas Turun (top down)\r\nCara Bawah Naik (bottom up)\r\nCara Dekomposisi\r\n\r\nB. ALAT-ALAT PENGEMBANGAN\r\nSISTEM\r\nAlat-alat yang tersedia untuk pendekatan ini, di antaranya:\r\nbagan alir sistem (system flow chart),\r\ndiagram arus data (dataflow diagram),\r\nkamus data (data dictionary),\r\nbagan alir program (program flow chart),\r\nbagan terstruktur (structured chart),\r\nstructured english,\r\npseudocode dan\r\ntabel keputusan (decision table) .\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-05-19T05:45:00+07:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-05-19-aplikasi-sistem-informasi/",
    "title": "Aplikasi Sistem Informasi",
    "description": "Modul 4",
    "author": [
      {
        "name": "Tedy Herlambang",
        "url": "https://bangtedy.github.io"
      }
    ],
    "date": "2022-04-22",
    "categories": [],
    "contents": "\r\nPendahuluan\r\nModul ini membahas aplikasi sistem-sistem informasi di organisasi.\r\nSetelah mempelajari dengan baik modul ini, Anda diharapkan mampu:\r\n\r\nmenjelaskan penerapan sistem informasi dalam di fungsi-fungsi\r\norganisasi;\r\n\r\nmemahami apa yang disebut dengan sistem pengolahan transaksi;\r\n\r\nmemahami apa yang disebut dengan sistem informasi manajemen;\r\n\r\nmenjelaskan penerapan sistem informasi di level-level organisasi;\r\n\r\nmemahami sistem otomatisasi kantor;\r\n\r\nmengaplikasikan sistem informasi;\r\n\r\nmemahami enterprise resource planning;\r\n\r\nmengetahui strategi dalam kompetisi informasi;\r\n\r\nmenjelaskan hubungan dan arti penting sis tern informasi strategi\r\nbisnis;\r\n\r\nmenjelaskan tantangan dan peluang sistem informasi manajemen.\r\nKEGIATAN\r\nBELAJAR 1: Aplikasi Sistem Informasi di Fungsi-fungsi\r\nOrganisasi\r\nSistem informasi dapat diterapkan di dalam fungsi-fungsi\r\norganisasi atau di tingkatan-tingkatan organisasi.\r\nJika struktur perusahaan didasarkan pada fungsi-fungsi\r\norganisasinya maka unit- unit di perusahaan dikelompokkan ke dalam\r\nbeberapa fungsi atau departemen, seperti akuntansi, keuangan, pemasaran,\r\nproduksi, sumber daya manusia.\r\nSistem informasi terdiri dari enam komponen, yaitu input, model,\r\noutput, teknologi, basis data, dan kontrol (lihat Modul 2).\r\n\r\n\r\n\r\nJika keenam komponen sistem informasi ini diterapkan ke dalam\r\nfungsi-fungsi organisasi akan menj adi sistem-sistem informasi\r\nfungsional atau yang disebut dengan nama lain sistem informasi manajemen\r\n(management information systems).\r\nsistem informasi akuntansi (accounting information\r\nsystem).\r\nsistem informasi keuangan (financial information\r\nsystem).\r\nsistem informasi pemasaran (marketing information\r\nsystem).\r\nsistem informasi produksi (production information system\r\natau manufacturing information system)\r\nsistem informasi sumber daya manusia (human resource\r\ninformation system)\r\nA. SISTEM-SISTEM\r\nINFORMASI FUNGSIONAL\r\nSistem informasi manajemen dapat digunakan untuk mendukung\r\nkegiatan-kegiatan yang ada di fungsi-fungsi bisnis –> functional\r\ninformation system\r\n\r\nSIA\r\nSistem informasi pemasaran (SIMPEM)\r\nSistem Informasi Produksi (SIMPRO)\r\nSistem Informasi Somber Daya Manusia\r\nSistem Informasi Keuangan\r\nB. ENTERPRISE RESOURCE\r\nPLANNING (ERP)\r\nEnterprise Resource Planning (ERP) adalah suatu perangkat lunak\r\npaket dengan aplikasi yang terintegrasi untuk digunakan secara luas di\r\norganisasi.\r\nKEGIATAN\r\nBELAJAR 2: Implementasi Keperawatan Komunikasi\r\nA. SISTEM-SISTEM\r\nINFORMASI DI LEVEL BAWAH\r\nTujuan utama dari sistem informasi di level ini adalah untuk\r\nmenjawab pertanyaan-pertanyaan rutin untuk keperluan mengontrol arus\r\ndari transaksi yang terjadi di organisasi.\r\nB. SISTEM-SISTEM\r\nINFORMASI DI LEVEL MENENGAH\r\nDigunakan untuk pengendalian dan pengambilan keputusan manajemen\r\nyang sifatnya setengah terstruktur (semi structured),\r\nSistem pakar (SP) atau expert Systems (ES), jaringan neural\r\nbuatan (JNB) atau artificial neural network (ANN), sistem penunjang\r\nkeputusan (SPK) atau decision support systems (DSS) atau group support\r\nsystems (GSS), sistem informasi geografis (SIG) atau geographic\r\ninformation systems (GIS).\r\nC. SISTEM-SISTEM\r\nINFORMASI DI LEVEL ATAS\r\nSistem informasi eksekutif (SIE) atau executive information system\r\n(EIS) adalah sistem informasi yang digunakan oleh manajer tingkat atas\r\nuntuk membantu pemecahan masalah tidak terstruktur\r\n(unstructured).\r\nD. SISTEM OTOMATISASI KANTOR\r\nSistem informasi berbasis telekomunikasi yang mengumpulkan,\r\nmemproses, menyimpan dan mendistribusikan pesan-pesan, dokumen-dokumen\r\ndan komunikasi elektronik lainnya di antara individual, grup-grup kerja\r\ndan organisasi- organisasi.\r\nMenghubungkan ke tiga level manajemen\r\n\r\nKEGIATAN\r\nBELAJAR 3: Aplikasi Sistem Informasi Untuk Keunggulan Kompetitif\r\nA. SISTEM INFORMASI\r\nSTRATEGIK\r\nMengimplementasikan satu atau lebih strategi-strategi\r\nkompetisi.\r\nTiga strategi umum yang biasanya perusahaan menerapkan untuk\r\nmenghadapi pesaing-pesaingnya: cost leadership,\r\ndifferentiation, dan focus.\r\n1. Cost Leadership Strategy\r\nMendukung posisi sebagai produsen dengan biaya terendah di dalam\r\nindustri, yaitu dengan cara:\r\nmenurunkan secara drastis biaya proses bisnis dengan melakukan\r\nrekayasa proses bisnis (business process reengineering),\r\nmenurunkan biaya dari pemasok, dan\r\nmenurunkan biaya ke pelanggan.\r\n\r\n2. Differentiation Strategy\r\nmendukung penyediaan produk atau jasa yang berbeda atau unik dengan\r\nnilai yang lebih besar kepada pelanggan dibandingkan dengan\r\npesaing-pesaingnya.\r\n3. Focus Strategy\r\nSuatu sistem informasi dikatakan mendukung strategi ini jika dapat\r\nmembantu perusahaan memfokuskan pada produk atau jasa khusus di suatu\r\nniche khusus di dalam organisasi.\r\nB. SISTEM INFORMASI ANTAR\r\nORGANISASI\r\nMenghubungkan antara perusahaan dengan pemasok dan perusahaan dengan\r\npelanggan secara on-line.\r\nIndustri penerbangan dan perhotelan, yaitu perusahaan-perusahaan\r\npenerbangan, jaringan hotel, agen-agen perjalanan dan konsumen\r\ndihubungkan dengan suatu jaringan sistem pemesanan booking pesawat dan\r\npenginapan.\r\nPerbankan: bank-bank dihubungkan dengan nasabah dengan menggunakan\r\ne-banking, ATM\r\nBursa efek: investor, emiten, regulator, etc.\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-05-19-aplikasi-sistem-informasi/26-komponen-si.png",
    "last_modified": "2022-05-19T05:48:53+07:00",
    "input_file": {},
    "preview_width": 712,
    "preview_height": 524
  },
  {
    "path": "posts/2022-05-19-pengambilan-keputusan-manajemen-dan-informasi-yang-dibutuhkan/",
    "title": "Pengambilan Keputusan Manajemen dan Informasi yang Dibutuhkan",
    "description": "Modul 3",
    "author": [
      {
        "name": "Tedy Herlambang",
        "url": "https://bangtedy.github.io"
      }
    ],
    "date": "2022-04-11",
    "categories": [],
    "contents": "\r\nPendahuluan\r\nModul ini akan membahas pengambilan keputusan manajemen. Manajemen\r\nmembutuhkan informasi sebagai dasar pengambilan keputusan. Sistem\r\ninformasi mempunyai peran penting dalam menyediakan informasi untuk\r\nsemua tingkatan.\r\nSetelah mempelahari dengan baik modul ini, Anda diharapkan\r\nmampu\r\n\r\nmenjelaskan pelaku-pelaku atau aktor-aktor yang berkaitan atau yang\r\nberkepentingan dalam SIM, mulai dari top, middle dan lower\r\nmanagement.\r\n\r\nmenjelaskan konsep dasar pengambilan keputusan\r\n\r\nmenjelaskan hubungan antara atau arti penting sistem informasi bagi\r\npengambilan keputusan\r\n\r\nmenjelaskan tipe kegiatan manajemen,\r\n\r\nmenjelaskan tipe keputusan manajemen,\r\n\r\nmenjelaskan peran manajemen dalam sistem informasi,\r\n\r\nmenjelaskan pengaruh gaya kognitif dalam pengambilan keputusan\r\n\r\nmenjelaskan tipe informasi yang diperlukan manajemen,\r\n\r\nmenjelaskan karakteristik informasi manajemen pada organisasi,\r\n\r\nmenjelaskan model logikal\r\n\r\nmenunjukkan contoh-contoh aplikasi sistem informasi dalam\r\norganisasi\r\n\r\nmenjelaskan metode pemilihan alternatif informasi dalam pengambilan\r\nkeputusan.\r\nKEGIATAN BELAJAR 1\r\nPengambilan Keputusan\r\nManajemen\r\nA. TIPE KEGIATAN MANAJEMEN\r\nManajemen tingkat atas: perencanaan strategis\r\nProses evaluasi lingkungan organisasi\r\nPenetapan tujuan\r\nPenentuan strategi\r\nManajemen tingkat menengah: pengendalian manajemen, meyakinkan\r\norganisasi menjalankan strategi yang ditetapkan dengan efektif dan\r\nefisien.\r\nManajemen tingkat bawah: pengendalian operasi, meyakinkan\r\ntugas-tugas dilaksanakan secara efektif dan efisien.\r\n\r\nB. TIPE KEPUTUSAN MANAJEMEN\r\n\r\nC. PERAN MANAJEMEN\r\nhubungan personal: figur kepala, pemimpin, penghubung\r\nperan informasi: menerima dan menyebarkan informasi, juru\r\nbicara\r\nperan keputusan: entrepreneur, menangani gangguan, mengalokasikan\r\nsumberdaya, negosiator.\r\nD. GAYA KOGNITIF PENGAMBILAN KEPUTUSAN - Tahap:\r\ninteligence, design, choice, dan implementation\r\nKEGIATAN BELAJAR 2\r\nInformasi\r\nuntuk Pengambilan Keputuasan Manajemen\r\nA. TIPE INFORMASI\r\n\r\nB. KARAKTERISTIK INFORMASI\r\nKepadatan Informasi\r\n\r\nLuas Informasi\r\n\r\nFrekuensi Informasi\r\n\r\nSkedul Informasi\r\n\r\nWaktu Informasi\r\n\r\nAkses Informasi\r\nSumber Informasi\r\n\r\nC. SISTEM-SISTEM INFORMASI DI FUNGSI-FUNGSI\r\nORGANISASI\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-05-19T05:30:46+07:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-05-19-konsep-sistem-informasi/",
    "title": "Konsep Sistem Informasi",
    "description": "Modul 2",
    "author": [
      {
        "name": "Tedy Herlambang",
        "url": "https://bangtedy.github.io"
      }
    ],
    "date": "2022-04-08",
    "categories": [],
    "contents": "\r\nCapaian Pembelajaran\r\nSetelah mempelahari dengan baik modul ini, mahasiswa diharapkan\r\nmampu\r\n\r\nmenjelaskan pengertian dan arti penting sistem informasi bagi\r\norganisasi\r\n\r\nmenjelaskan perkembangan dari sistem informasi\r\n\r\nmenjelaskan peran-peran dari sistem informasi\r\n\r\nmenjelaskan konsep sistem informasi manajemen\r\n\r\nmenjelaskan kerangka kerja sistem informasi\r\n\r\nmenjelaskan rancang bangun dan komponen-komponen sistem informasi\r\n\r\nmenjelaskan integrasi sistem informasi\r\n\r\nmenjelaskan model pengolahan data\r\n\r\nmenjelaskan model matematika\r\n\r\nmenjelaskan model logikal\r\n\r\nmenunjukkan contoh-contoh aplikasi sistem informasi dalam\r\norganisasi\r\n\r\nmenjelaskan sistem informasi dan organisasi.\r\nKEGIATAN BELAJAR 1\r\nPERKEMBANGAN SISTEM\r\nINFORMASI\r\nA. ERA AKUNTANSI DAN OPERASIONAL\r\nPerkembangan sistem teknologi informasi terkait sangat erat dengan\r\nperkembangan sistem komputer.\r\nCoba perhatikan spek komputer pertama:\r\nIt weighed more than 27 tons\r\nSize: roughly 2.4 m × 0.9 m × 30 m, occupied 167 m2\r\nConsumed 150 kW of electricity.\r\nCost: equivalent to $7,195,000 in 2019\r\nSource: wikipedia\r\nB. ERA INFORMASI\r\nC. ERA JEJARING\r\nD. ERA JEJARING GLOBAL\r\nE. ORGANISASI SISTEM TEKNOLOGI INFORMASI\r\nF. PERAN MANAJER SISTEM TEKNOLOGI INFORMASI\r\nMasih ingat tiga pilar kualitas sistem informasi? tepat kepada\r\norangnya atau relevan (relevance), tepat waktu (timeliness), dan tepat\r\nnilainya atau akurat (accurate).\r\nKeluaran yang tidak didukung oleh ketiga pilar ini tidak dapat\r\ndikatakan sebagai informasi yang berguna, tetapi merupakan sampah\r\n(garbage).\r\n\r\n\r\n\r\nSekarang kita perluas dengan menambahkan dua komponen lagi:\r\n\r\n\r\n\r\nSumber: Sousa, Kenneth (2015)\r\nKEGIATAN BELAJAR 2\r\nKOMPONEN-KOMPONEN SISTEM\r\nINFORMASI\r\n\r\n\r\n\r\nApakah komponen pada Gambar 2.4 sudah cukup?\r\nPerlu komponen menyimpan data yang belum diolah (basis data),\r\nsehingga membentuk Gambar 2.5.\r\n\r\n\r\n\r\nApakah komponen pada Gambar 2.5 sudah cukup?\r\nBagaimana menghasilkan informasi yang relevan? Perlu model\r\nBagaimana menghasilkan informasi yang tepat waktu? Perlu\r\nteknologi\r\nBagaimana menghasilkan informasi yang akurat? Perlu kontrol\r\nSehingga modelnya kita perluas menjadi Gambar 2.6:\r\n\r\n\r\n\r\nA. KOMPONEN INPUT:\r\nBahan dasar untuk diolah menjadi informasi\r\nMost data an organization uses as input to its Information system\r\nare generated and collected within the organization.\r\nThese data elements result from transactions undertaken in the\r\ncourse of doing business. A transaction is a business event: a sale, a\r\npurchase, a payment, the hiring of a new employee, and the like. T\r\nThese transactions can be recorded on paper and later entered into a\r\ncomputer system; directly recorded through a transaction processing\r\nsystems (TPS), such as a point-of-sale (POS) machine, scanner, or\r\ncamera; or captured online when someone transacts through the web.\r\nA TPS is any system that records transactions.\r\nOften, the same system also processes the transactions, summarizing\r\nand routing information to other systems; therefore, these systems are\r\ntransaction processing systems, not just transaction recording\r\nsystems.\r\nExternal data sources can also be used by organisations such as :\r\nCustomers, competitors, and suppliers\r\nGovernment agencies and financial institutions\r\nLabor and population statistics\r\nEconomic conditions\r\n\r\nB. KOMPONEN OUTPUT:\r\nInformasi yang berguna sesuai konteksnya.\r\nThe information an IS displays in the format most useful to an\r\norganization.\r\nThe most widely used output device is the video display, or video\r\nmonitor, which displays output visually.\r\nAnother common output device is the printer, used to print hard\r\ncopies of information on paper.\r\nHowever, computers can communicate output through speakers in the\r\nform of music or speech and also can transmit it to another computer or\r\nelectronic device in computer-coded form, for later interpretation.\r\nC. KOMPONEN BASIS DATA:\r\nA database, the heart of an information system, is a collection of\r\nall relevant data organized in a series of integrated files.\r\nTo create, organize, and manage databases, a database management\r\nsystem (DBMS) is used, such as Microsoft Access or FileMaker Pro for\r\nhome or small-office use. In a large organization, a DBMS such as Oracle\r\nor IBM DB2 might be used.\r\nD. KOMPONEN MODEL: model logika, model matematika\r\nE. KOMPONEN TEKNOLOGI: mempercepat proses pengolahan data\r\nF. KOMPONEN KONTROL: menjamin informasi yang dihasilkan oleh sistem\r\ninformasi akurat\r\n\r\n\r\n\r\nG. KOMPONEN MANUSIA\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-05-19-konsep-sistem-informasi/gambar1.12-tiga-pilar-informasi.png",
    "last_modified": "2022-05-19T05:27:34+07:00",
    "input_file": {},
    "preview_width": 370,
    "preview_height": 448
  },
  {
    "path": "posts/2022-05-19-konsep-dasar-sistem-dan-lnformasi/",
    "title": "Konsep Dasar Sistem dan lnformasi",
    "description": "Modul 1",
    "author": [
      {
        "name": "Tedy Herlambang",
        "url": "https://bangtedy.github.io"
      }
    ],
    "date": "2022-03-29",
    "categories": [],
    "contents": "\r\nCapaian Pembelajaran\r\nSemua yang ada di dunia ini dapat dilihat sebagai sebuah sistem.\r\nUntuk memahami sistem dapat dengan mempelajari definisi atau\r\nkarakternya.\r\nSesudah mempelajari dengan baik modul ini Anda diharapkan mampu:\r\n\r\nmenjelaskan definisi sebuah sistem;\r\n\r\nmenjelaskan perbedaan sistem fisik dan sistem prosedural;\r\n\r\nmenjelaskan karakteristik dari suatu sistem;\r\n\r\nmenjelaskan klasifikasi sistem;\r\n\r\nmenjelaskan pengendalian sistem;\r\n\r\nmemahami pengendalian pencegahan;\r\n\r\nmemahami pengendalian umpan balik;\r\n\r\nmemahami pengendalian umpan maju;\r\n\r\nmenjelaskan definisi informasi;\r\n\r\nmengetahui mutu sebuah informasi;\r\n\r\nmengetahui arti penting suatu informasi bagi organisasi;\r\n\r\nmenjelaskan jenis sistem dan subsistem informasi;\r\n\r\nmenjelaskan pengendalian dalam sistem;\r\n\r\nmengetahui penilaian sebuah informasi.\r\nKEGIATAN BELAJAR 1\r\nPengertian Sistem\r\nA. PENDEKATAN PEMAHAMAN SISTEM\r\nPendekatan prosedur: sistem sebagai kumpulan dari prosedur-prosedur\r\nyang mempunyai tujuan tertentu.\r\nPendekatan komponen: sistem adalah kumpulan dari komponen yang\r\nsaling berhubungan satu dengan yang lainnya membentuk satu kesatuan\r\nuntuk mencapai tujuan tertentu.\r\n\r\nManakah dari pendekatan ini yang benar?\r\n\r\nB. DEFINISI SISTEM\r\nSecara umum, suatu sistem terdiri dari struktur dan\r\nproses.\r\nBeberapa definisi dari sistem menyebutkan bahwa sistem terdiri\r\ndari struktur dan proses.\r\nAkan tetapi, beberapa definisi dari sistem hanya menyebutkan\r\nkumpulan dari struktur atau proses saja.\r\nSistem yang didefinisikan sebagai kumpulan dari struktur bukan\r\nberarti sistem tersebut tidak mempunyai proses.\r\nSistem yang strukturnya lebih dominan dari prosesnya adalah\r\nsistem fisik.\r\nBeberapa definisi sistem hanya menyebutkan suatu sistem merupakan\r\nkumpulan dari proses saja.\r\nSistem yang prosesnya lebih dominan dari struktumya adalah sistem\r\nprosedural.\r\n\r\nCek beberapa definisi sistem di BMP\r\n\r\nTeknologi Informasi\r\ndan Sistem Informasi\r\nInformation technology (IT) consists of all the hardware and\r\nsoftware that a firm needs to use to achieve its business objectives.\r\nThis includes not only computers, disk drives, and mobile handheld\r\ndevices but also software, such as the Windows or Linux operating\r\nsystems, the Microsoft Office desktop productivity suite, and the many\r\nthousands of computer programs that can be found in a typical large\r\nfirm\r\n\r\nInformation systems are more complex and can be understood best by\r\nlooking at them from both a technology and a business\r\nperspective.\r\nAn information system (IS) can be defined technically as a set of\r\ninterrelated components that collect (or retrieve), process, store, and\r\ndistribute information to support decision making, coordinating, and\r\ncontrol in an organization.\r\nIn addition, information systems may also help managers and workers\r\nanalyse problems, visualize complex subjects, and create new\r\nproducts.\r\n\r\nDefinisi mana yang\r\nakan digunakan? Checklist:\r\nApakah suatu sistem kumpulan dari komponen-komponen atau\r\nkumpulan-kumpulan dari proses-proses?\r\nUntuk sistem fisik yang memang terdiri dari banyak komponen-komponen\r\nfisik maka pendekatan komponen lebih tepat.\r\nUntuk sistem prosedural yang memang terdiri dari banyak\r\nproses-prosesnya maka pendekatan prosedur lebih tepat digunakan.\r\nUntuk mempelajari sistem informasi manajemen, yang merupakan sistem\r\nfisik maka pendekatan komponen yang lebih tepat digunakan.\r\nPendekatan komponen ini akan lebih mengena juga di dalam mempelajari\r\nsuatu sistem untuk tujuan analisis dan perancangan sistem informasi.\r\nUntuk menganalisis dan merencanakan suatu sistem, analis, dan\r\nperancang sistem harus mengerti terlebih dahulu mengenai komponen-\r\nkomponen atau elemen-elemen atau subsistem-sub-sistem dari sistem\r\ntersebut.\r\n\r\nC. KARAKTERISTIK SISTEM\r\nKarakteristik sistem:\r\nkomponen-komponen (components),\r\nbatas sistem (boundary),\r\nlingkungan luar sistem (environments),\r\npenghubung (interface),\r\nmasukan (input),\r\nkeluaran (output),\r\npengolah (process) dan\r\nsasaran (objectives) atau tujuan (goal).\r\n\r\nD. KLASIFIKASI SISTEM\r\nsistem abstrak (abstract system) dan sistem fisik (physical\r\nsystem).\r\nsistem alamiah (natural system) dan sistem buatan manusia (human\r\nmade system).\r\nsistem tertentu (deterministic system) dan sistem tak tentu\r\n(probabilistic system).\r\nsistem tertutup (closed system) dan sistem terbuka (open\r\nsystem)\r\nE. PENGENDALIAN SISTEM\r\npengendalian umpan balik (feedback control system),\r\n\r\npengendalian umpan maju (feed forward control system)\r\nmencoba mendorong proses dari sistem supaya menghasilkan hasil balik\r\nyang positif\r\nSupaya keluaran dapat dihasilkan umpan balik yang positif maka\r\npengendalian tidak boleh diukur dari keluarannya, tetapi diukur dan\r\ndikendalikan dari prosesnya.\r\nSelama proses terjadi di dalam sistem, selalu dilakukan pengamatan\r\ndan cepat-cepat diatasi apabila mulai terjadi penyimpangan sebelum\r\nterlanjur fatal pada keluarannya.\r\n\r\npengendalian pencegahan (preventive control system): pengendalian\r\npencegahan mencoba untuk mengendalikan sistem di muka sebelum proses\r\ndimulai dengan mencegah hal-hal yang merugikan untuk masuk ke dalam\r\nsistem.\r\nTiga kegiatan di dalam\r\nsistem informasi\r\nSistem informasi mengandung informasi tentang organisasi dan\r\nlingkungannya.\r\nTiga aktivitas yang menghasilkan informasi yang diperlukan\r\norganisasi untuk membuat keputusan, mengendalikan operasi, menganalisis\r\npersoalan dan menciptakan produk atau layanan baru: input, processing,\r\nand output.\r\nMasukan/input captures or collects raw data from within the\r\norganization or from its external environment.\r\nPengolahan/processing converts this raw input into a meaningful\r\nform.\r\nKeluaran/output transfers the processed information to the people\r\nwho will use it or to the activities for which it will be used.\r\nInformation systems also require feedback, which is output that is\r\nreturned to appropriate members of the organization to help them\r\nevaluate or correct the input stage.\r\nUmpan balik/feedback is output returned to appropriate people or\r\nactivities in the organization to evaluate and refine the input.\r\nPelaku di lingkungan luar organisasi/environmental actors, such as\r\ncustomers, suppliers, competitors, stockholders, and regulatory\r\nagencies, interact with the organization and its information\r\nsystems.\r\n\r\n\r\n\r\nSumber: Laudon, Kenneth C., and Jane P. Laudon (2017)\r\nKEGIATAN BELAJAR 2\r\nA. Konsep Dasar Informasi\r\nInformation systems contain information about significant people,\r\nplaces, and things within the organization or in the environment\r\nsurrounding it.\r\nInformation: data that have been shaped into a form that is\r\nmeaningful and useful to human beings.\r\nInformation: is facts or conclusions that have meaning within a\r\ncontext\r\nData, in contrast, are streams of raw facts representing events\r\noccurring in organizations or the physical environment before they have\r\nbeen organized and arranged into a form that people can understand and\r\nuse.\r\nData: a given or fact, which might take the form of a number, a\r\nstatement, or a picture.\r\nInformasi (information) adalah sebagai data yang diolah ke dalam\r\nbentuk yang berguna bagi para pemakainya sesuai konteksnya.\r\nData adalah kenyataan yang menggambarkan suatu kejadian-kejadian dan\r\nkesatuan nyata.\r\nData merupakan bentuk yang masih mentah, belum dapat berceritera\r\nbanyak sehingga perlu diolah lebih lanjut.\r\nKejadian-kejadian (event) adalah sesuatu yang terjadi pada saat yang\r\ntertentu.\r\n\r\n\r\n\r\nSumber: Laudon, Kenneth C., and Jane P. Laudon (2017)\r\nIlustrasi\r\nSistem Informasi Akuntansi Perusahaan\r\n\r\n\r\n\r\nSumber: Laudon, Kenneth C., and Jane P. Laudon (2017)\r\nKomponen Sistem Informasi\r\nData: Input that the system takes to produce information\r\nHardware A computer and its peripheral equipment: input, output, and\r\nstorage devices; hardware also includes data communication\r\nequipment\r\nSoftware Sets of instructions that tell the computer how to take\r\ndata in, how to process it, how to display information, and how to store\r\ndata and information\r\nTelecommunications Hardware and software that facilitate fast\r\ntransmission and reception of text, pictures, sound, and animation in\r\nthe form of electronic data\r\nPeople Information systems professionals and users who analyse\r\norganizational information needs, design and construct information\r\nsystems, write computer programs, operate the hardware, and maintain\r\nsoftware.\r\nProcedures Rules for achieving optimal and secure operations in data\r\nprocessing; procedures include priorities in dispensing software\r\napplications and security measures.\r\nEmpat Langkah Pengolahan\r\nData\r\nEntering data into the IS (input).\r\nChanging and manipulating the data in the IS (data processing).\r\nGetting information out of the IS (output).\r\nStoring data and information (storage).\r\n\r\n\r\n\r\nSumber: Laudon, Kenneth C., and Jane P. Laudon (2017)\r\nB. SIKLUS INFORMASI\r\n\r\n\r\nTujuan Sistem Informasi\r\nPeople require information for many reasons and in varied\r\nways.\r\nContoh mahasiswa mencari informasi untuk hiburan dan pencerahan\r\ndengan menonton Tiktok, YouTube, browsing the Internet, listening to the\r\nradio, and reading newspapers, magazines, and books.\r\n\r\nDi dalam bisnis, manajer dan organisasi mencari informasi untuk\r\nmembuat keputusan yang tepat dan menyelesaikan persoalan.\r\nWhat is a problem? A problem is the root cause of an undesirable\r\nsituation.\r\nPada saat mobil Anda mogok di jalan tol, Anda punya masalah.\r\nPada saat seorang pelanggan tidak membayar angsurannya, tetapi Anda\r\ntidak tahu siapa pelanggan yang menunggak itu dan berapa besar\r\ntunggakannya, Anda dalam masalah.\r\n\r\nAnda bisa menyelesaikan kedua masalah ini dengan bantuan\r\ninformasi.\r\nDi kasus pertama, Anda bisa memanggil derek atau montir\r\nterdekat.\r\nDi kasus kedua, dengan menggunakan perangkat lunak akuntansi\r\nsederhana, Anda bisa menemukan pelanggan itu.\r\n\r\nSeorang manajer yang mengidentifikasi lebih dari satu solusi dan\r\nmungkin dilematis, harus memilih dan memutuskan salah satu solusi yang\r\nterbaik.\r\nContoh: Bagaimana meningkatkan penjualan produk terbaru perusahaan\r\nyang baru dirilis? Salah satunya dengan promosi. Promosi dimana? TV,\r\nradio, koran, web, social media, direct mail, atau kombinasi dari\r\nberbagai saluran ini?. Dilema ini membutuhkan keputusan.\r\nBoth problem solving and decision making require information.\r\nMengumpulkan informasi yang tepat dan efisien dan menyimpannya\r\nsehingga dapat digunakan dan dimanipulasi jika diperlukan sangat penting\r\nuntuk membantu organisasi mencapai tujuannya.\r\nC. KUALITAS INFORMASI\r\nTiga pilar: tepat kepada orangnya atau relevan (relevance), tepat\r\nwaktu (timeliness), dan tepat nilainya atau akurat (accurate).\r\nKeluaran yang tidak didukung oleh ketiga pilar ini tidak dapat\r\ndikatakan sebagai informasi yang berguna, tetapi merupakan sampah\r\n(garbage).\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-05-19-konsep-dasar-sistem-dan-lnformasi/aktivitas-sim.png",
    "last_modified": "2022-05-19T05:46:42+07:00",
    "input_file": {},
    "preview_width": 604,
    "preview_height": 428
  }
]
